% íàáîð ñêðèïòîâ äëÿ ìîäåëèðîâàíèÿ ÐÑÀ
% Íàçíà÷åíèå è ïîðÿäîê èñïîëüçîâàíèÿ:
% main - çàäàíèå ïðîñòðàíñòâåííîé ñèòóàöèè, ïàðàìåòðîâ ÐËÑ, êîîðäèíàò áëåñòÿùèõ òî÷åê
% CalcSigShortTime - ðàññ÷åò îòðàæåííîãî ñèãíàëà âîññòàíîâëåíèåì èç ñæàòîãî
% CalcRliXYss-1 - ðàñ÷åò ÐËÈ â êîîðäèíàòàõ (x,y) ñ ìàðøðóòíîì ðåæèìå ñ ïåðåäèñêðåòèçàöèåé
% ChirpSig - ðàñ÷åò çîíäèðóþùåãî ñèãíàëà è èìïóëüñíîé õàðàêòåðèñòèêè

clear all;
% îáùèå ïåðåìåííûå
c=3*10^8;
j=sqrt(-1);
df=25*10^6;       % øèðèíà ñïåêòðà çîíäèðóþùåãî ñèãíàëà
Ks=1;             % êîýôôèöèåíò Íàéêâèñòà äëÿ èñõîäíîãî ñèãíàëà
Kss=4;            % êîýôôèöèåíò ïåðåäèñêðåòèçàöèè
T0=10^-5;         % äëèòåëüíîñòü èìïóëüñà
Fs=Ks*df;         % ÷àñòîòà äèñêðåòèçàöèè
T=4*T0;           % äëèòåëüíîñòü ìîäåëèðóåìîãî ó÷àñòêà 
N=round(T*Fs);    % ÷èñëî îò÷åòîâ â ïðåäåëàõ ïåðèîäà ïîâòîðåíèÿ
N=2^ceil(log2(N)); % ïðèâîäèì ÷èñëî îòñ÷åòîâ ê îñíîâàíèþ 2
b=pi*df/T0;       % ñêîðîñòü èçìåíåíèÿ êðóãîâîé ÷àñòîòû ïîïîëàì
mu=df/T0;         % ñêîðîñòü èçìåíåíèÿ öèêëè÷åñêîé ÷àñòîòû
h0=zeros(N,1);    % èìïóëüñíàÿ õàðàêòåðèñòèêà ôèëüòðà ÂÏÎ
lamda=0.03;       % äëèíà âîëíû
f0=c/lamda;       % íåñóùàÿ ÷àñòîòà

Tn=1.0;           % îáùåå âðåìÿ íàáëþäåíèÿ
Tr=0.25*10^-3;    % ïåðèîä ïîâòîðåíèÿ
Q=round(Tn/Tr);   % ÷èñëî èìïóëüñîâ â ïà÷êå
Tsint=0.4;        % âðåìÿ ñèíòåçèðîâàíèÿ

Prsa=5000;                 % ìîùíîñòü èçëó÷åíèÿ
Grsa=2.5e04;               % êîýôôèöèåíò óñèëåíèÿ àíòåííû 
N0=1e-20;                  % ñïåêòðàëüíàÿ ïëîòíîñòü ìîùíîñòè âíóòðåííèõ øóìîâ
Pnoise=N0*df;              % ìîùíîñòü âíóòðåííèõ øóìîâ
alfa=0.5*pi/180;           % øèðèíà ÃË ÄÍ ïî àçèìóòó
beta05=2.5*pi/180;         % øèðèíà ÃË ÄÍ ïî óãëó ìåñòà
Nadc=10;                   % ÷èñëî ðàçðÿäîâ ÀÖÏ
dacp=3*sqrt(Pnoise/2)/2^4; % âûäåëÿåì íà øóì 4 ðàçðÿäà ÀÖÏ 

% ïàðàìåòðû ìîäåëèðîâàíèÿ îòðàæåííîãî ñèãíàëà
gamma=5;          % ãëàâíûé è äî ÷åòûðåõ áîêîâûõ ëåïåñòêîâ

% FlagInter=0 - ðàñ÷åò ÒÑ äëÿ ñîâìåùåííîãî èçëó÷àþùåãî è ïðèåìíîãî êàíàëà,
% êîîðäèíàòû êîòîðîãî â Xrls(1),Yrls(1),Zrls(1)
% FlagInter=1 - ðàñ÷åò ÒÑ äëÿ èçëó÷àþùåãî êàíàëà è äâóõ ïðèåìíûõ êàíàëîâ, 
% êîîðäèíàòû ïåðåäàò÷èêà â Xrls(1),Yrls(1),Zrls(1), êîîðäèíàòû ïðèåìíèêîâ
% Xrls(:3),Yrls(2:3),Zrls(2:3)
FlagInter=1; 
L=6; % ðàññòîÿíèå ìåæäó ïðè¸ìíûìè êàíàëàìè

% ñêîðîñòü ÐÑÀ
Vxrls=0*10^3;   Vyrls=7612;            Vzrls = 0; 
Vrls=sqrt(Vxrls^2+Vyrls^2+Vzrls^2);
Axrls=0;        Ayrls = 0;           Azrls = 0;
% êîîðäèíàòû ÐÑÀ: ïåðâîå çíà÷åíèå - ôàçîâîãî öåíòðà ïåðåäàþùåé àíòåííû, 
% âòîðîé è òðåòüå çíà÷åíèÿ - ôàçîâûõ öåíòðîâ ïðèåìíûõ àíòåííû  
X0rls=0;            Y0rls=-Q*Tr*Vrls/2;   Z0rls=500*10^3;
Xrls(1)=X0rls;      Xrls(2)=X0rls;        Xrls(3)=X0rls; 
Yrls(1)=Y0rls;      Yrls(2)=Y0rls-L/2;    Yrls(3)=Y0rls+L/2;
Zrls(1)=Z0rls;      Zrls(2)=Z0rls;        Zrls(3)=Z0rls;

% êîîðäèíàòû ñòðåëêè ñ îòðàæàòåëÿìè
% x=[700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3;700*10^3-10;700*10^3-20;700*10^3-30;700*10^3-40;700*10^3+10;700*10^3+20;700*10^3+30;700*10^3+40];
% y=[0;25;50;75;100;125;150;175;200;225;250;275;300;275;250;225;200;275;250;225;200];
% z=[0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0];

% êîîðäèíàòû äàë¸êèõ íåïîäâèæíûõ òî÷åê
% Nx=10;
% Ny=10;
% x=zeros(Nx*Ny,1);
% y=zeros(Nx*Ny,1);
% z=zeros(Nx*Ny,1);
% x0=700*10^3;
% y0=0;
% z0=0;
% dx=50;
% dy=50;
% for i=1:Nx
%     for k=1:Ny
%         n=(i+(k-1)*Nx);
%         x(n)=x0-Nx*dx/2+i*dx;
%         y(n)=y0-Ny*dy/2+k*dy;
%     end    
% end

% figure; scatter(x,y);

% êîîðäèíàòû áëåñòÿùèõ òî÷åê íà çåìíîé ïîâåðõíîñòè
x=[701021; 701024; 701021; 701024];
y=[0;        30;     60;       90];
z=[0;         0;      0;        0];
% ÝÏÐ áëåñòÿùèõ òî÷åê
SigBt=zeros(length(x),1); 
SigBt(1)=1000; SigBt(2)=0; SigBt(3)=0; SigBt(4)=0;
FiBT=random('unif',0,2*pi,length(x),1);
K=length(SigBt);
% ñêîðîñòè áëåñòÿùèõ òî÷åê
Vx=zeros(length(x),1); Vy=zeros(length(x),1); Vz=zeros(length(x),1);
Vx(1)=0; Vy(1)=0;
Vx(2)=0; Vy(2)=0;
Vx(3)=0; Vy(3)=0;
Vx(4)=0; Vy(4)=0;
% äëÿ âñåõ ÁÒ ðàññ÷èòûâàâàåì ìîùíîñòü îòðàæåííîãî ñèãíàëà íà äëÿ t=0
for k=1:K
    d=sqrt((x(k)-Xrls(1))^2+(y(k)-Yrls(1))^2+(z(k)-Zrls(1))^2);
    Ps(k)=Prsa*Grsa^2*lamda^2*SigBt(k)/((4*pi)^3*d^4);
end    

% èìïóëüñíàÿ õàðàêòåðèñòèêà ÑÔ
for n=1:N
    h0(n,1)=conj(ChirpSig(T0-(n-1)/Fs,T0,b)); 
end
Gh0=fft(h0); Gh0=Gh0/sqrt(N); % Ê×Õ ÑÔ

% íà÷àëüíîå âðåìÿ çàäåðæêè â 1-îì ìîìåíòå
tz0=2*sqrt((Xrls(1)-x(1))^2+(Yrls(1)-y(1))^2+(Zrls(1)-z(1))^2)/c;
t2=tz0-5*10^-6;
% ôîðìèðîâàíèå òðàåêòîðíîãî ñèãíàëà
CalcSigShortTime;
% ôîðìèðîâàíèå ÐËÈ â êîîðäèíàòàõ (x,y) c ïåðåäèñêðåòèçàöèåé
CalcRliXYss_1;
